Emacs.org
* Конфигурация Emacs
** Расширение пути загрузки файлов

~load-path~ - список директорий, в которых выполняется поиск файлов для загрузки.
Каждый элемент списка это имя директории или ~nil~ в случае директории по умолчанию.
Этот список используется функцией ~require~.
В список заносится путь, где находятся все файлы конфигурации.

#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el :mkdirp yes

(add-to-list 'load-path (expand-file-name "~/.config/emacs"))

#+end_src

** Конфигурация пакетного менеджера ~straight~

В качестве пакетного менеджера будет использоваться ~straight~.
Для вдохновения использалась статья [[https://systemcrafters.net/advanced-package-management/using-straight-el/][Advanced Emacs Package Management with straight.el]].
~straight~ предоставляет более детальный контроль за тем, как управлять пакетами в конфигурации Emacs. В качестве источника пакетов может быть использован MELPA, ELPS или GitHub, GitLab репозитории.
Поскольку используются репозитории, то есть возможность точно указать для каждого пакета, какая версия (ветка и даже коммит) должна использоваться.

Основые возможности ~straight~:
- лёгкая инсталляци и обновления пакетов;
- интеграция с ~use-package~;
- интеграция с MELPA и ELPA пакетами;
- можно устанавливать пакеты из Git репозиториев;
- можно устанавливать свои версии пакетов из своих репозиториев;
- используемый список пакетов полностью воспроизводим.

*** Загрузка ~straight~

Поскольку ~straight~ не поставляется с Emacs необходимо быть увереным, что его можно установить без использования ~package.el~ (пакетный менеджер по умолчанию).

#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el :mkdirp yes

(defvar bootstrap-version)
(let ((bootstrap-file
      (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
        "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
        'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

#+end_src

Если ~straight.el~ уже установлен, то скрипт не будет скачиваться заново.

*** Использование ~straight~
**** Загрузка пакетов
Загрузка пакетов производится вызовом команды ~straight-use-package~.
~straight~ самостоятельно скачивает пакеты, компилирует и добавляет из в путь Emacs.

**** Обновление пакетов
Для обновления пакетов можно использовать команды:
- ~M-x straight-pull-package~ - вытягивает один пакет и обновляет его до последней версии;
- ~M-x straight-pull-package-and-deps~ - вытягивает один пакет и все его зависимости и обновляет его до последней версии;
- ~M-x straight-pull-all~ - вытягивает все активные пакеты.

**** Удаление пакетов
Чтобы пакеты не загружались достаточно закоментировать вызов пакета ~straight-use-package~.

Для удаления неиспользуемых пакетов можно воспользоваться ~M-x straight-remove-unused-repos~.

*** Интеграция с ~use-package~
Включить интеграцию с ~use-package~ можно указать

#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el :mkdirp yes

(straight-use-package 'use-package)

#+end_src

Автоматическая установка пакетов без небходимости указывать ~:straight t~ возможна, когда указывается в настройках

#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el :mkdirp yes

(setq straight-use-package-by-default t)

#+end_src

Это эквивалентно установке ~use-package-always-ensure~ в ~t~.

*** Запирание версий пакетов

~straight~ позволяет запирать версии пакетов, в этом случае на другой машине можно воспроизвести нужные версии пакетов. Версии запираются в файле ~straight/versions/default.el~.
Для генерации файла можно вызвать ~М-x straight-freeze-versions~.
Для восстановления версий на основе этого файла нужно вызвать команду ~M-x straight-thaw-versions~ после вызова ~M-x straight-pull-all~.

** Файл пользовательской конфигурации
Устанавливается имя файла для хранения пользовательской конфигурации.
Для этого используется переменная ~custom-file~.

#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el :mkdirp yes

(setq custom-file "~/.emacs-config/config-custom.el")
(if (file-exists-p custom-file)
  (load custom-file))

#+end_src

** Запуск Emacs как сервер
Emacs запускается как сервер, чтобы делиться общими настройками со всеми ~emacsclient~.
Ниже выполняется проверка, что Emacs не запущен как сервер и если проверка успешна, то Emacs запускается как сервер.

#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el :mkdirp yes

(use-package server
  :ensure nil
  :config
  (unless (server-running-p)
  (server-start)))

#+end_src

** Настройки календаря

Настройки календаря касаются локализации и настроек отображения.
Установка первого дня недели в календаре.

#+begin_src emacs-lisp :tangle ~/.config/emacs/config-calendar.el :mkdirp yes

(setq calendar-week-start-day 1)

#+end_src

Установка текста с номером недели в году слева от каждого месяца в календаре.
Для номеров недели используется шрифт, который используется для выделения - ~'font-lock-warning-face~.

#+begin_src emacs-lisp :tangle ~/.config/emacs/config-calendar.el :mkdirp yes

(setq calendar-intermonth-text
      '(propertize
        (format "%2d"
                (car
                 (calendar-iso-from-absolute
                 (calendar-absolute-from-gregorian (list month day year)))))
        'font-lock-face 'font-lock-warning-face))

#+end_src

Установка текста заголовка слева от каждого месяца в календаре для отображения номера недели. Используется шрифт для отображения ключевых слов.

#+begin_src emacs-lisp :tangle ~/.config/emacs/config-calendar.el :mkdirp yes

(setq calendar-intermonth-header
      (propertize "НН"
                  'font-lock-face 'font-lock-keyword-face))

#+end_src

Установка русской локализации для названий дней недели и месяцев.
#+begin_src emacs-lisp :tangle ~/.config/emacs/config-calendar.el :mkdirp yes

(setq calendar-day-name-array
      ["Восресенье" "Понедельник"
       "Вторник" "Среда"
       "Четверг" "Пятница"
       "Суббота"]
      calendar-day-header-array
      ["Вс" "Пн"
       "Вт" "Ср"
       "Чт" "Пт"
       "Сб"]
      calendar-month-name-array
      ["Январь" "Февраль" "Март"
       "Апрель" "Май" "Июнь"
       "Июль" "Август" "Сентябрь"
       "Октябрь" "Ноябрь" "Декабрь"])

#+end_src

Регистрация в виде модуля ~config-calendar~.

#+begin_src emacs-lisp :tangle ~/.config/emacs/config-calendar.el :mkdirp yes

(provide 'config-calendar)

#+end_src

** Настройки управления файлами
Меняются настройки по умаолчанию для манипуляции с файлами.

*** Настройка места хранения файлов для восстановления
В переменной ~backup-directory-alist~ указывается ассоциативный массив, где ключом каждой пары является регулярное выражение, а значением директория, куда сохраняется файл для восстановления, имя которого подходит под регулярное выражение.
Все файлы для восстановления сохраняются в директорию ~/tmp/~, которая устанвилвается через переменную ~temporary-file-directory~.

#+begin_src emacs-lisp :tangle ~/.config/emacs/config-file.el :mkdirp yes

(setq backup-directory-alist
      `((".*" . ,temporary-file-directory)))

#+end_src

Устанавливается правило преобразования имён файлов при сохранении буферов. Все автосохраняемые файлы сохраняются в директорию временных файлов независимо от того, где они изначально находились.

#+begin_src emacs-lisp :tangle ~/.config/emacs/config-file.el :mkdirp yes

(setq auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))

#+end_src

*** Настройка правил работы с удаляемыми файлами

Удаляемые файлы отправляются в системную мусорную корзину.
Этому правилу подчиняется интерактивный вызов удаления файла или директории.

#+begin_src emacs-lisp :tangle ~/.config/emacs/config-file.el :mkdirp yes

(setq delete-by-moving-to-trash t)

#+end_src

*** Отключение блокировки файла

Отключение функционала создания файлов блокировки для защиты от коллизий редактирования.

#+begin_src emacs-lisp :tangle ~/.config/emacs/config-file.el :mkdirp yes

(setq create-lockfiles nil)

#+end_src

*** Регистрация модуля ~config-file~

Регистрация в виде модуля ~config-file~.

#+begin_src emacs-lisp :tangle ~/.config/emacs/config-file.el :mkdirp yes

(provide 'config-file)

#+end_src


** TODO Настройка ввода

#+begin_src emacs-lisp :tangle ~/.config/emacs/config-input.el :mkdirp yes

;;------------------------------------------------------------------------------
;; set default font
;;------------------------------------------------------------------------------

(if (find-font (font-spec :name "Iosevka Comfy"))
  (set-face-attribute 'default nil :font "Iosevka Comfy" :height 180))

;; Set the fixed pitch face
(if (find-font (font-spec :name "Iosevka Comfy"))
  (set-face-attribute 'fixed-pitch nil
                    :font "Iosevka Comfy"
                    :weight 'regular
                    :height 180))

;; ;; Set the fixed pitch face
;; (if (find-font (font-spec :name "JetBrains Mono"))
;;   (set-face-attribute 'fixed-pitch nil
;;                     :font "JetBrains Mono"
;;                     :weight 'regular
;;                     :height 180))

(if (find-font (font-spec :name "Iosevka Comfy Duo"))
  (set-face-attribute 'variable-pitch nil
                    ;; :font "Cantarell"
                    :font "Iosevka Comfy Duo"
                    :height 245
                    :weight 'regular))

;; (if (find-font (font-spec :name "Iosevka Aile"))
;;   (set-face-attribute 'variable-pitch nil
;;                     ;; :font "Cantarell"
;;                     :font "Iosevka Aile"
;;                     :height 245
;;                     :weight 'regular))


;;------------------------------------------------------------------------------
;; setup default input method to russian-computer
;;------------------------------------------------------------------------------
(setq default-input-method "russian-computer")


;;------------------------------------------------------------------------------
;; setup default coding system - UTF-8
;;------------------------------------------------------------------------------
(set-default-coding-systems 'utf-8)

;;------------------------------------------------------------------------------
;; disable beep sound
;;------------------------------------------------------------------------------
(setq visible-bell 1)
(setq ring-bell-function 'ignore)

(provide 'config-input)

#+end_src

