Emacs.org
** TODO Настройки буфера

#+begin_src emacs-lisp :tangle ~/.config/emacs/config-buffer.el :mkdirp yes

  ;;------------------------------------------------------------------------------
  ;; enable line numbers
  ;;------------------------------------------------------------------------------
  ;;(global-linum-mode t)


  ;;------------------------------------------------------------------------------
  ;; visualization of matching parens
  ;;------------------------------------------------------------------------------
  (show-paren-mode t)


  ;;------------------------------------------------------------------------------
  ;; list of tab stop positions
  ;;------------------------------------------------------------------------------
  (setq tab-stop-list (number-sequence 4 120 4))


  ;;------------------------------------------------------------------------------
  ;; show column in the mode line
  ;;------------------------------------------------------------------------------
  ;; (column-number-mode 1)

  (column-number-mode)
  (setq display-line-numbers 'relative)

  ;; Enable line numbers for some modes
  (dolist (mode '(;;text-mode-hook
		    ;;conf-mode-hook
		    prog-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 1))))
    ;; (add-hook mode (lambda () (highlight-indent-guides-mode 1))))

  ;; Override some modes which derive from the above
  (dolist (mode '(org-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
    ;; (add-hook mode (lambda () (highlight-indent-guides-mode 0))))

  ;;------------------------------------------------------------------------------
  ;; toggle line highlighting
  ;;------------------------------------------------------------------------------
  (global-hl-line-mode 1)


  ;;------------------------------------------------------------------------------
  ;; trailing whitespace is unnecessary
  ;;------------------------------------------------------------------------------
  (add-hook 'before-save-hook (lambda() (delete-trailing-whitespace)))

  ;;------------------------------------------------------------------------------
  ;; do not truncate lines
  ;;------------------------------------------------------------------------------
  (setq-default truncate-lines t)

  ;;------------------------------------------------------------------------------
  ;; getting rid of the “yes or no” prompt and replace it with “y or n”
  ;;------------------------------------------------------------------------------
  (fset 'yes-or-no-p 'y-or-n-p)

  ;;------------------------------------------------------------------------------
  ;; getting rid the annoying confirmation if a file or ddddddd dddd
  ;; buffer does not exist when you use C-x C-f or C-x b.
  ;; ------------------------------------------------------------------------------
  (setq confirm-nonexistent-file-or-buffer nil)

  ;;------------------------------------------------------------------------------
  ;; kill a buffer with a live process attached to it
  ;;------------------------------------------------------------------------------
  (setq kill-buffer-query-functions
    (remq 'process-kill-buffer-query-function
	    kill-buffer-query-functions))

  ;;------------------------------------------------------------------------------
  ;; Whether to add a newline automatically at the end of the file.
  ;; A value of t means do this only when the file is about to be saved.
  ;;------------------------------------------------------------------------------
  (setq require-final-newline t)


  ;; helps with easily switching between windows based on a predefined set of keys used to identify each.
  (use-package ace-window
    :bind (("M-o" . ace-window))
    :custom
    (aw-scope 'frame)
    (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
    (aw-minibuffer-flag t)
    :config
    (ace-window-display-mode 1))

  (use-package anzu
    :after isearch
    ;; :disabled				; using ivy + swiper
    :config
    (global-anzu-mode))

(use-package multiple-cursors
  :requires (cl-lib)
  :custom
  (mc/always-run-for-all t)
  :bind
  (("C-M-<mouse-3>" . mc/add-cursor-on-click)))


(use-package page-break-lines)

(use-package emojify
  :requires (seq ht)
  :commands emojify-mode)


  (provide 'config-buffer)

#+end_src


** TODO Настройки минибуфера

#+begin_src emacs-lisp :tangle ~/.config/emacs/config-minibuffer.el :mkdirp yes

      ;; Enable richer annotations using the Marginalia package
      (use-package marginalia
	;; Either bind `marginalia-cycle` globally or only in the minibuffer
	:bind (;; ("M-A" . marginalia-cycle)
	       :map minibuffer-local-map
	       ("M-A" . marginalia-cycle))
	;; The :init configuration is always executed (Not lazy!)
	:init
	;; Must be in the :init section of use-package such that the mode gets
	;; enabled right away. Note that this forces loading the package.
	(marginalia-mode))

      (use-package embark
	:bind
	(("C-." . embark-act)))


	;; Enable vertico
	(use-package vertico
	  :straight (:files (:defaults "extensions/*"))
	  :init
	  (vertico-mode)

	  ;; Grow and shrink the Vertico minibuffer
	  (setq vertico-resize t)

	  ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
	  (setq vertico-cycle t)
	  (setq vertico-multiform-commands
		   '((consult-line reverse buffer)
		     (consult-imenu reverse buffer)
		     (consult-grep reverse buffer)))

	   ;; (setq vertico-multiform-categories
	   ;;       '((file buffer grid)
	   ;;         (imenu (:not indexed mouse))
	   ;;         (symbol (vertico-sort-function . vertico-sort-alpha))))

	  (vertico-multiform-mode))

	;; Optionally use the `orderless' completion style. See
	;; `+orderless-dispatch' in the Consult wiki for an advanced Orderless style
	;; dispatcher. Additionally enable `partial-completion' for file path
	;; expansion. `partial-completion' is important for wildcard support.
	;; Multiple files can be opened at once with `find-file' if you enter a
	;; wildcard. You may also give the `initials' completion style a try.
	(use-package orderless
	  :init
	  ;; Configure a custom style dispatcher (see the Consult wiki)
	  ;; (setq orderless-style-dispatchers '(+orderless-dispatch)
	  ;;       orderless-component-separator #'orderless-escapable-split-on-space)
	  (setq completion-styles '(orderless basic)
		  completion-category-defaults nil
		  completion-category-overrides '((file (styles . (partial-completion))))))

    ;; Example configuration for Consult
    (use-package consult
      ;; Replace bindings. Lazily loaded due by `use-package'.
      :bind (;; C-c bindings in `mode-specific-map'
	     ("C-c M-x" . consult-mode-command)
	     ("C-c h" . consult-history)
	     ("C-c k" . consult-kmacro)
	     ("C-c m" . consult-man)
	     ("C-c i" . consult-info)
	     ([remap Info-search] . consult-info)
	     ;; C-x bindings in `ctl-x-map'
	     ("C-x M-:" . consult-complex-command)     ;; orig. repeat-complex-command
	     ("C-x b" . consult-buffer)                ;; orig. switch-to-buffer
	     ("C-x 4 b" . consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
	     ("C-x 5 b" . consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
	     ("C-x r b" . consult-bookmark)            ;; orig. bookmark-jump
	     ("C-x p b" . consult-project-buffer)      ;; orig. project-switch-to-buffer
	     ;; Custom M-# bindings for fast register access
	     ("M-#" . consult-register-load)
	     ("M-'" . consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
	     ("C-M-#" . consult-register)
	     ;; Other custom bindings
	     ("M-y" . consult-yank-pop)                ;; orig. yank-pop
	     ;; M-g bindings in `goto-map'
	     ("M-g e" . consult-compile-error)
	     ("M-g f" . consult-flymake)               ;; Alternative: consult-flycheck
	     ("M-g g" . consult-goto-line)             ;; orig. goto-line
	     ("M-g M-g" . consult-goto-line)           ;; orig. goto-line
	     ("M-g o" . consult-outline)               ;; Alternative: consult-org-heading
	     ("M-g m" . consult-mark)
	     ("M-g k" . consult-global-mark)
	     ("M-g i" . consult-imenu)
	     ("M-g I" . consult-imenu-multi)
	     ;; M-s bindings in `search-map'
	     ("M-s d" . consult-find)
	     ("M-s D" . consult-locate)
	     ("M-s g" . consult-grep)
	     ("M-s G" . consult-git-grep)
	     ("M-s r" . consult-ripgrep)
	     ("M-s l" . consult-line)
	     ("M-s L" . consult-line-multi)
	     ("M-s k" . consult-keep-lines)
	     ("M-s u" . consult-focus-lines)
	     ;; Isearch integration
	     ("M-s e" . consult-isearch-history)
	     :map isearch-mode-map
	     ("M-e" . consult-isearch-history)         ;; orig. isearch-edit-string
	     ("M-s e" . consult-isearch-history)       ;; orig. isearch-edit-string
	     ("M-s l" . consult-line)                  ;; needed by consult-line to detect isearch
	     ("M-s L" . consult-line-multi)            ;; needed by consult-line to detect isearch
	     ;; Minibuffer history
	     :map minibuffer-local-map
	     ("M-s" . consult-history)                 ;; orig. next-matching-history-element
	     ("M-r" . consult-history))                ;; orig. previous-matching-history-element

      ;; Enable automatic preview at point in the *Completions* buffer. This is
      ;; relevant when you use the default completion UI.
      :hook (completion-list-mode . consult-preview-at-point-mode)

      ;; The :init configuration is always executed (Not lazy)
      :init

      ;; Optionally configure the register formatting. This improves the register
      ;; preview for `consult-register', `consult-register-load',
      ;; `consult-register-store' and the Emacs built-ins.
      (setq register-preview-delay 0.5
	    register-preview-function #'consult-register-format)

      ;; Optionally tweak the register preview window.
      ;; This adds thin lines, sorting and hides the mode line of the window.
      (advice-add #'register-preview :override #'consult-register-window)

      ;; Use Consult to select xref locations with preview
      (setq xref-show-xrefs-function #'consult-xref
	    xref-show-definitions-function #'consult-xref)

      ;; Configure other variables and modes in the :config section,
      ;; after lazily loading the package.
      :config

      ;; Optionally configure preview. The default value
      ;; is 'any, such that any key triggers the preview.
      ;; (setq consult-preview-key 'any)
      ;; (setq consult-preview-key "M-.")
      ;; (setq consult-preview-key '("S-<down>" "S-<up>"))
      ;; For some commands and buffer sources it is useful to configure the
      ;; :preview-key on a per-command basis using the `consult-customize' macro.
      (consult-customize
       consult-theme :preview-key '(:debounce 0.2 any)
       consult-ripgrep consult-git-grep consult-grep
       consult-bookmark consult-recent-file consult-xref
       consult--source-bookmark consult--source-file-register
       consult--source-recent-file consult--source-project-recent-file
       ;; :preview-key "M-."
       :preview-key '(:debounce 0.4 any))

      ;; Optionally configure the narrowing key.
      ;; Both < and C-+ work reasonably well.
      (setq consult-narrow-key "<") ;; "C-+"

      ;; Optionally make narrowing help available in the minibuffer.
      ;; You may want to use `embark-prefix-help-command' or which-key instead.
      (define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help)

      ;; By default `consult-project-function' uses `project-root' from project.el.
      ;; Optionally configure a different project root function.
      ;;;; 1. project.el (the default)
      ;; (setq consult-project-function #'consult--default-project--function)
      ;;;; 2. vc.el (vc-root-dir)
      ;; (setq consult-project-function (lambda (_) (vc-root-dir)))
      ;;;; 3. locate-dominating-file
      ;; (setq consult-project-function (lambda (_) (locate-dominating-file "." ".git")))
      ;;;; 4. projectile.el (projectile-project-root)
      ;; (autoload 'projectile-project-root "projectile")
      ;; (setq consult-project-function (lambda (_) (projectile-project-root)))
      ;;;; 5. No project support
      ;; (setq consult-project-function nil)
    )

(use-package embark-consult)
(use-package consult-recoll)


  (use-package which-key
    :init (which-key-mode)
    :config
    (setq which-key-idle-delay 0.3))

(use-package savehist
  :config
  (setq history-length 25)
  (savehist-mode 1))

(provide 'config-minibuffer)

#+end_src


** TODO Настройка строки состояния

#+begin_src emacs-lisp :tangle ~/.config/emacs/config-statusbar.el :mkdirp yes

(use-package nerd-icons)

(use-package nerd-icons-dired
  :after (nerd-icons)
  :hook
  (dired-mode . nerd-icons-dired-mode))

(use-package nerd-icons-completion
  :after marginalia
  :config
  (nerd-icons-completion-mode)
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

  (use-package shrink-path)

  (use-package doom-modeline
    :ensure t
    ;; :after (all-the-icons shrink-path dash)
    :after
	  (nerd-icons shrink-path)
    :custom
	  (doom-modeline-height 20)
	  (doom-modeline-buffer-file-name-style 'truncate-all)
	  (doom-modeline-buffer-encoding t)
	  (doom-modeline-vcs-max-length 20)
    :custom-face
	  (mode-line-highlight ((t (:inherit doom-modeline-bar :foreground "black"))))
	  (doom-modeline-buffer-path ((t (:inherit font-lock-comment-face :slant normal))))
    :config
	  (column-number-mode)
    :init
	  (doom-modeline-mode))

  (setq display-time-24hr-format 't)
  (display-time)

  (provide 'config-statusbar)

#+end_src


** TODO Поиск файлов

#+begin_src emacs-lisp :tangle ~/.config/emacs/config-search.el :mkdirp yes
  (use-package ripgrep)

  (use-package deadgrep
  :commands deadgrep
  :bind
  (
   :map deadgrep-mode-map
	("C-c C-e" . deadgrep-edit-mode)))


  (provide 'config-search)


#+end_src


