config-buffer.el
;;------------------------------------------------------------------------------
;; enable line numbers
;;------------------------------------------------------------------------------
(global-linum-mode t)


;;------------------------------------------------------------------------------
;; visualization of matching parens
;;------------------------------------------------------------------------------
(show-paren-mode t)


;;------------------------------------------------------------------------------
;; list of tab stop positions
;;------------------------------------------------------------------------------
(setq tab-stop-list (number-sequence 4 120 4))


;;------------------------------------------------------------------------------
;; show column in the mode line
;;------------------------------------------------------------------------------
(column-number-mode 1)


;;------------------------------------------------------------------------------
;; toggle line highlighting
;;------------------------------------------------------------------------------
(global-hl-line-mode 1)


;;------------------------------------------------------------------------------
;; trailing whitespace is unnecessary
;;------------------------------------------------------------------------------
(add-hook 'before-save-hook (lambda() (delete-trailing-whitespace)))

;;------------------------------------------------------------------------------
;; do not truncate lines
;;------------------------------------------------------------------------------
(setq-default truncate-lines t)


(provide 'config-buffer)
